{"data":{"workYaml":{"content":[{"description":"Meetomar.com is a story about a troll roaming the land to discover his forever home under a bridge in Omaha Nebraska. The challenge was to bring a digital interactive experience for meetomar book online. My role was the lead web developer @ Swanson Russell with directions from the lead UX.","image":"work/meet-omar.png","title":"Meet Omar","url":"https://omarthetroll.stagesr.com/","tags":"[‘#React’, ‘#JS’, ‘#SASS’, ‘#HTML’, ‘#AudioAPI’]"},{"description":"Textron Systems is known for it innovative defense, government and aerospace technologies and services. My role was lead developer @ Swanon Russell.","image":"work/textron-systems.png","title":"Textron Systems","url":"https://www.textronsystems.com/","tags":"[‘#Drupal’, ‘#PHP’, ‘#Vue’, ‘#Twig’, ‘#Scss’]"},{"description":"The Oven is an Indian food restaurant in Lincoln and Omaha Nebraska with multiple locations. One of the biggest things I am proud of this site was converting the menu from PDF to online format. This was great for the client since they're constantly adding and removing items from the menu. This was a freelance project where I was able to be the designer and lead web developer.","image":"work/the-oven.png","title":"The Oven","url":"https://theoven-lincoln.com/","tags":"[‘#Jekyll’, ‘#JS’, ‘#SASS’]"},{"description":"Nebraska State Fair is the largest fair in Nebraska and only happens once a year! One thing I am proud about on this site is the mobile menu. Used Vue.js and Drupal rest menu API to build out a dynamic menu. My role was lead developer @ Swanson Russell.","image":"work/nsf.png","title":"Nebraska State Fair","url":"https://statefair.org/","tags":"[‘#Drupal’, ‘#PHP’, ‘#Vue’, ‘#Twig’, ‘#SASS’]"},{"description":"Amvac is a chemical company focused in the agriculture space with an international presence. One major task given to me during the build was to figure out a way to fetch all the data needed for the home page marquee product filtering. My role was developer following the lead of the lead backend developer and lead frontend developer.","image":"work/amvac.png","title":"Amvac","url":"https://www.amvac.com/","tags":"[‘#Drupal’, ‘#PHP’, ‘#Vue’, ‘#Twig’, ‘#Scss’]"},{"description":"Geisler is a roofing company in Kansas that need an online presence to reach more customers. Used targeted Google ads to drive potential customers to the site. This was a freelance project in collaboration with ION design co. My role was UX and Developer.","image":"work/geisler.png","title":"Geisler Roofing","url":"https://geislerroofing.com/","tags":"[‘#Jekyll’, ‘#JS’, ‘#SASS’]"}]}}}